export const modalStories: { [key: string]: string | JSX.Element } = {
    '설계': <p>부품 설계는 공학의 꿈이 도로에 닿는 곳—제 경우에는 실제로 그렇습니다! 대학 시절, <a href="https://www.racehanyang.com" target="_blank">RACE</a> 클럽에서 자동차 부품을 설계하던 중이었습니다. CATIA와 ANSYS를 사용하며 밤을 새우고, 범퍼가 멋져야 하는지 아니면 실제로 보호 기능을 해야 하는지에 대해 논의하는 학생들이 모여 있는 모습을 상상해 보세요. 제 경험은 실제 자동차 부품에 뿌리를 두고 있지만, 대량 생산에 대한 제 지식은 여전히 교과서 기반입니다. 대중을 위한 설계는 보기 좋거나 완벽하게 맞는 것 이상의 것을 요구하며, 확장성과 비용 효율성도 고려해야 합니다. 조립 라인을 경외감과 두려움이 섞인 시선으로 바라보는 저를 보면 그 이유를 아실 겁니다!</p>,
    
    '분석' : "부품 분석은 진짜 마법이 일어나는 곳이거나, 조심하지 않으면 상황이 극적으로 나빠질 수 있는 곳입니다! 유체 및 열 분석을 진행하면서, 부품이 단순히 보기 좋게 앉아 있는 것이 아니라, 환경과 지속적으로 상호 작용하고 있음을 배웠습니다. 진동 및 제어 시스템 분석을 통해, 가장 작은 흔들림이 큰 차이를 만들 수 있음을 알게 되었습니다. 그리고 실패 분석은 부서진 조각과 좌절한 한숨으로 단서가 주어지는 탐정 역할과 비슷합니다. 부품 분석은 종종 마라톤, 스프린트가 아닌데, 초기 설계보다 훨씬 까다롭고 시간이 많이 소요됩니다.",
    
    '자동차' : <p>자동차와의 여정은 여름 동안 정비소에서 일하면서 시작되었습니다—그때의 밝은 주황색 작업복 사진이 아직도 있었으면 좋겠네요. 실습 경험을 쌓았지만, 이 기계적 경이로움의 내부 작동은 여전히 다소 신비로웠습니다. 대학에 들어가고 <a href="https://www.racehanyang.com" target="_blank">RACE</a> 클럽에 합류하면서, 자동차의 다이나믹스를 배우기 시작했고, 서스펜션 팀으로 옮겨서 충격 흡수의 비밀을 파헤쳤습니다. <a href="https://www.racehanyang.com" target="_blank">RACE</a>에서 자동차가 어떻게 작동하는지에 대한 전체 그림을 이해하게 되었고, 초기의 흥미를 완전한 열정으로 바꿀 수 있었습니다.</p>,
    
    '코딩' : "저의 코딩 여정은 12살 때 아버지와의 내기에서 시작되었습니다: 프로그램을 작성하지 않으면 10달러를 잃을 것이라고 하셨어요. 그 도전에 응했지만, 깊게 코딩에 몰두하게 된 것은 대학 때였습니다. Python으로 시작해서 MATLAB, JavaScript, C++를 포함하여 기술을 확장했습니다. 한 언어에 익숙해지면 다른 언어를 배우는 것이 훨씬 쉬워지더군요. 마치 같은 언어의 여러 방언을 익히는 것처럼—각각의 고유한 맛이 있지만, 핵심 원리는 동일합니다.",
    
    'AI & DL/ML' : <p>AI 수업에서 머신러닝을 처음 접했습니다. 이 수업은 김도쿠스 교수님이 진행하셨으며, AI 역사부터 실제 프로그래밍까지 모두 다루었고, 끝에는 제 CNN을 만들었습니다. 이후, <a href="https://www.kist.re.kr/ko/research/introduction-ai-intel.do" target="_blank">한국과학기술연구원(KIST)</a> 교수님 연구실에서 인턴십을 진행하며 AI 분야에서 커리어를 이어갔습니다. 매주 두 번의 회의에서 학술 논문에 대해 연구하고 발표하며, 김 교수님께서는 DreamFusion에서 Plenoxels에 이르기까지 AI 세계의 최신 개발 사항을 이야기해주셨습니다. 첫 학술 대회인 <a href='https://kcvs.kr/?act=info.workshop&pseq=4' target='_blank'>한국 컴퓨터 비전 컨퍼런스(KCCV)</a>에도 참석했습니다. 현재는 Kaggle의 ML 챌린지에 참여하고 있습니다.</p>,
    
    '3D 모델링' : <p>엔지니어로서 3D 모델링 도구를 항상 사용하고 있지만, 그것은 그들의 완성된 상태입니다. 3D 렌더링을 처음 접한 것은 <a href="https://www.kist.re.kr/ko/research/introduction-ai-intel.do" target="_blank">한국과학기술연구원(KIST)</a>에서 인턴십을 진행하며 AI 모델 훈련을 위한 장면 렌더링과 후처리를 하면서였습니다. 3D 마법이 어떻게 일어나는지 뒤에서 보는 기분이었습니다. 이후, 김덕수 교수님과 함께 <a href="https://spacemap42.com" target="_blank">스페이스맵</a>을 위해 지구상의 위성 3D 모델을 만들었습니다. 3D 모델링이 추상적인 데이터를 시각적이고 매력적인 것으로 변환할 수 있다는 것이 꽤 멋집니다.</p>,
    
    'UI/UX 디자인' : "저는 기계 공학 전공이라 UI/UX 디자인은 제 훈련 분야가 아닙니다. 그러나 좋은 디자인을 항상 존중하기 때문에 어떻게 이루어지는지 이해하고 싶었습니다. 저는 독학으로 배우며 항상 배우는 것을 좋아합니다. 첫 프로젝트로 이 웹페이지를 디자인했으며, 웹 디자인에 능숙하다고 주장하는 사람에게 이 페이지가 그다지 멋지지 않다고 생각하신다면, 첫째로, 아프네요. 둘째로, 말씀드린 대로, 이건 제 첫 프로젝트였습니다. 셋째로, 이 페이지는 원래 비디오 게임 또는 뉴스 테마일 예정이었으나, A/B 테스트 후, 더 전문적으로 만들어야 한다는 의견이 있었습니다.",
    
    '웹 개발' : <p>웹 개발은 <a href="https://spacemap42.com" target="_blank">스페이스맵</a>에서 시작되었습니다. 회사의 프론트엔드 팀에 끌려서, 웹 개발 과정 수료 후 프로젝트를 진행하기 시작했습니다. 저는 취미로 웹 개발을 한다고 하진 않을 것 같습니다. 왜냐하면 전문 팀에서 일한 경험이 있지만, 현재까지 웹 개발을 중심으로 경력을 쌓아본 적은 없기 때문입니다. 그러나 이 웹사이트는 제가 직접 만들었습니다. 웹 개발과 웹 디자인이 같은 것처럼 보일 수 있지만, 그래서 왜 분리했냐고요? 디자인에서 더 나아 보이기 위해서입니다. 하지만, 둘은 다릅니다. React를 배우는 데 몇 달이 걸렸으니, 이걸 알 수 있었어요.</p>,
    
    '학생 임원단' : <p>2022년, 삼성 드림 장학 재단 학생회장으로 활동할 기회를 가졌습니다. 이 역할에서, 저는 이벤트를 조직하고 학생들과 재단 간의 커뮤니케이션을 촉진하는 일을 맡았습니다. 이 경험은 저에게 리더십 기술을 개발하고 효과적으로 책임을 관리하며 협업 환경을 조성하는 능력을 입증할 기회를 제공했습니다. 다양한 그룹 간의 다리 역할을 하면서 복잡한 문제를 해결하고 이니셔티브를 추진하는 능력을 갈고 닦았으며, 전문적인 환경에서 리더십과 조직 관리 능력을 보여주었습니다.</p>,
    
    '소셜 미디어' : <p><a href='https://www.instagram.com/samsung_foundation/' target='_blank'>삼성꿈장학재단 임원단</a> 회장으로 재직하는 동안, 소셜 미디어 홍보를 관리하며 디지털 커뮤니케이션 및 참여 기술을 연마했습니다. 이 경험은 제 소셜 미디어 전략 접근 방식을 형성하는 데 중요한 역할을 했습니다. 이 기반 위에, 이후 <a href="https://spacemap42.com" target="_blank">스페이스맵</a>에서 유사한 역할을 맡아 회사의 소셜 미디어 계정을 관리했습니다. 제 작업은 회사의 온라인 존재감과 홍보를 크게 향상시켰습니다.—참여를 유도하고 강력하고 응집력 있는 브랜드 이미지를 구축하는 것이 중요합니다.</p>,
    
    '토론': <p>자라면서, 제 형제들과 저는 노래의 의미에서 읽은 책에 이르기까지 모든 것에 대한 아침 발표를 했었기 때문에, 공개 발언에 꽤 익숙했습니다. 고등학교 때 형의 권유로 토론을 시작했습니다. 대학 첫 해에는 <a href="https://www.instagram.com/hyds_official/" target="_blank">한양영어토론 동아리 (HYDS)</a>에 참여했습니다. KIDA 신인 대회에서 8강에 진출하기도 했죠. 하지만 계속해서 활동하진 않았고, 곧 <a href="https://www.racehanyang.com" target="_blank">RACE</a> 클럽에 빠졌습니다. 그래도 토론은 제 발 빠르게 생각하고 확실한 주장을 만드는 데 많은 것을 가르쳐주었고, 이는 분명히 저와 함께해왔습니다.</p>,
    
    '봉사 활동' : <p>자원봉사는 주변 커뮤니티와 진정으로 연결되는 가장 좋은 방법처럼 느껴졌습니다. UT Austin에서 교환 학기 동안 <a href="https://www.austintexas.gov/austin-animal-center" target="_blank">오스틴 동물센터</a>에서 자원봉사하며 사랑스러운 꼬리 흔드는 친구들과 함께 시간을 보내고 그들의 돌봄에 기여할 수 있었습니다. 서울로 돌아와서는 서울 노인 복지관에서 자원봉사하며 뜻깊은 상호작용을 나눌 수 있었습니다. 이러한 기회는 저에게 보답할 수 있는 기회를 제공했을 뿐만 아니라 지역 사회에 대한 이해를 깊게 해주었습니다.</p>,
};
